app/Controllers/Consulta.php

        if($this->request->getMethod()=="post" && $reglasValidacion)
        {
            $datosPost = $this->request->getPost();
            $this->consultas->save($datosPost);
---
INSERT INTO `consulta` (`con_Email`, `con_Nombre`, `con_Apellido`, `con_Asunto`, `con_Mensaje`, `fecha_creacion`, `fecha_modif`) VALUES ('chichipia25@gmail.com', 'Daniela Elizabeth', 'Mormina', 'zapatos', 'hay zapatos?', '2023-05-03 23:29:11', '2023-05-03 23:29:11')